
## Plan Result (prod)

[CI link](https://github.com/goda6565/portfolio/actions/runs/15206222699)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.cloudrun_domain_map.google_cloud_run_domain_mapping.default
* Update
  * module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudrun_domain_map.google_cloud_run_domain_mapping.default will be created
  + resource "google_cloud_run_domain_mapping" "default" {
      + id       = (known after apply)
      + location = "asia-northeast1"
      + name     = "goodyfolio.com"
      + project  = "portfolio-460206"
      + status   = (known after apply)

      + metadata {
          + effective_annotations = (known after apply)
          + effective_labels      = {
              + "goog-terraform-provisioned" = "true"
            }
          + generation            = 0
          + namespace             = "portfolio-460206"
          + resource_version      = (known after apply)
          + self_link             = (known after apply)
          + terraform_labels      = {
              + "goog-terraform-provisioned" = "true"
            }
          + uid                   = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "frontend-main"
        }
    }

  # module.cloudrun_service.google_cloud_run_v2_service.cloudrun_service will be updated in-place
  ~ resource "google_cloud_run_v2_service" "cloudrun_service" {
      - client                  = "gcloud" -> null
      - client_version          = "523.0.0" -> null
        id                      = "projects/portfolio-460206/locations/asia-northeast1/services/frontend-main"
        name                    = "frontend-main"
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label prod/add-or-update: POST https://api.github.com/repos/goda6565/portfolio/issues/35/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":35,"Program":"tfcmt","SHA1":"34153212a396270555fb8020a95c5ce1c4118ca0","Target":"prod","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->